app/controllers/books_controller.rb

INSERT INTO "books" ("title", "isbn", "page", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "teste de livro"], ["isbn", "13123"], ["page", 50], ["created_at", "2020-05-16 18:21:42.523350"], ["updated_at", "2020-05-16 18:21:42.523350"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "title" = ?, "isbn" = ?, "page" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "teste de livro22"], ["isbn", "13123567"], ["page", 500], ["updated_at", "2020-05-16 18:21:59.683373"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)